{"about": {
        "image": "assets/images/portrait-500.jpg",
        "paragraphs": [
            "A full stack developer and product manager that is passionate about the product. Obsessed about listening and understanding the customer’s needs.  Action oriented knowing the importance of delivering quality products on time to achieve customer confidence creates a great user experience.","Michael delivers clean and polished applications in a collaborative environment. An effective communicator that leads cross-functional teams with an ability to translate technology into everyday language for clients, users, and non-engineering teammates. Michael is a teammate who will manage individual tasks, work with a team pair programming and individual/group troubleshooting. Simply put Michael eagerly gets into the trenches and does whatever it takes to get the job done. Through clear communication and leadership skills, he delivers successful projects using Zoom pair programming, virtual teams and remote troubleshooting.","Michael thrives in startup environments where clear communication is vital for efficient and effective decision making to keep product development moving towards delivery on the due date."
        ]},
    "snippets":
    [
        {
            "title": "Product Focused",
            "icon": "fas fa-crosshairs",
            "description": "Delivering products on time to create great customer experiences is all about being action oriented and staying focused on the big picture.  Being product focused means keeping an eye on the big picture and helping everyone on the product team to stay focused on delivering on time."
        },
        {
            "title": "Customer Obsessed",
            "icon": "fas fa-universal-access",
            "description": "Knowing the customer, their needs, wants, and reasons is the best way of building products that solve customer needs.  While being a strong advocate for the customer, I am an advocate for solving the customers challenge which also requires advocating the best solution to fill their need."
        },
        {
            "title": "Collaborative",
            "icon": "fas fa-people-carry",
            "description": "I love working with cross-functional teams.  With an ability to communicate to diverse disciplines, I found that listening is key to building strong working relationships.  I like to bring out the best in people by actively listening to them, acknowledging their value, and rolling up my sleeves to help the team wherever needed.  People working together achieve much more."
        },
        {
            "title": "Ah-Ha Moment",
            "icon": "far fa-lightbulb",
            "description": "While there are many over the years, it's easy to over complicate a product and software.  It's hard to apply KISS. Keeping it Simple is always best!"
        }
    ],
    "techSkills": {
        "title": "Tech Skills",
        "skills": [
            "Full Stack", "MERN", "MySQL", "Mongo", "NoSQL", "IndexedDB", "jsonDB", "ORM", "ODM", "Express", "React", "Node.js", "JavaScript", "ES6", "JSX", "jQuery", "REST", "RESTful API", "SOAP", "API", "Context API", "Serverside API", "Web API", "3rd Party API", "JSON", "MVC", "OOP", "Stateful Deveopment", "HTML5", "CSS3", "CSS", "CSS framework", "Python", "Django", "Flask", "Sinatra", "Ruby", "Rails", "Ruby on Rails",  "git", "github", "Firebase", "AWS", "Azure", "Google", "Mapbox", "Leaflet.js", "Open Streets", "Problem-Solving"
        ]
    },
    "softSkills": {
        "title": "Soft Skills",
        "skills": [
            "Cross-functional teams", "Effective Communicator", "Presentation to Executive", "Management", "Clients", "Sales & Marketing", "Business Development", "Product Management", "Project Management", "Startups", "Highly Motivated", "Self Initiative", "Detail Oriented", "Team Collaboration", "Self Contributor"
        ]
    }
}